Test YCSB/WA-LOAD-200K
##MONGO DB 200K WORKLOAD A
Loading workload...
Starting test.
2024-04-02 22:11:33:651 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://root:j@localhost:27017/admin
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-02 22:11:43:347 10 sec: 3572 operations; 356,99 current ops/sec; est completion in 9 minutes [INSERT: Count=3573, Max=720383, Min=224, Avg=4115,01, 90=7931, 99=27023, 99.9=158335, 99.99=720383] 
2024-04-02 22:11:53:342 20 sec: 15070 operations; 1150,38 current ops/sec; est completion in 4 minutes [INSERT: Count=11497, Max=246271, Min=203, Avg=1725,13, 90=3257, 99=12815, 99.9=49311, 99.99=160383] 
2024-04-02 22:12:03:342 30 sec: 23166 operations; 809,6 current ops/sec; est completion in 3 minutes [INSERT: Count=8097, Max=68735, Min=190, Avg=2455,69, 90=4183, 99=13359, 99.9=42687, 99.99=63647] 
2024-04-02 22:12:13:343 40 sec: 35854 operations; 1268,8 current ops/sec; est completion in 3 minutes [INSERT: Count=12687, Max=87743, Min=142, Avg=1558,02, 90=3075, 99=10791, 99.9=40223, 99.99=81279] 
2024-04-02 22:12:23:342 50 sec: 37792 operations; 193,8 current ops/sec; est completion in 3 minutes [INSERT: Count=1940, Max=279295, Min=335, Avg=10256,47, 90=23327, 99=91263, 99.9=245631, 99.99=279295] 
2024-04-02 22:12:33:343 60 sec: 45719 operations; 792,62 current ops/sec; est completion in 3 minutes [INSERT: Count=7925, Max=598015, Min=178, Avg=2505,86, 90=5191, 99=23087, 99.9=78847, 99.99=291071] 
2024-04-02 22:12:43:342 70 sec: 53714 operations; 799,58 current ops/sec; est completion in 3 minutes [INSERT: Count=7995, Max=119743, Min=143, Avg=2489,56, 90=4771, 99=14791, 99.9=46719, 99.99=91199] 
2024-04-02 22:12:53:343 80 sec: 61342 operations; 762,8 current ops/sec; est completion in 3 minutes [INSERT: Count=7628, Max=680959, Min=171, Avg=2603,49, 90=4575, 99=17775, 99.9=65663, 99.99=664063] 
2024-04-02 22:13:03:347 90 sec: 62675 operations; 133,23 current ops/sec; est completion in 3 minutes [INSERT: Count=1337, Max=496639, Min=179, Avg=15091,03, 90=35935, 99=149503, 99.9=245887, 99.99=496639] 
2024-04-02 22:13:13:417 100 sec: 63249 operations; 57,07 current ops/sec; est completion in 3 minutes [INSERT: Count=570, Max=538623, Min=528, Avg=33993,89, 90=92351, 99=294655, 99.9=441599, 99.99=538623] 
2024-04-02 22:13:23:348 110 sec: 63708 operations; 46,17 current ops/sec; est completion in 3 minutes [INSERT: Count=462, Max=1189887, Min=542, Avg=44292,96, 90=98175, 99=466431, 99.9=1189887, 99.99=1189887] 
2024-04-02 22:13:33:364 120 sec: 64869 operations; 116,05 current ops/sec; est completion in 4 minutes [INSERT: Count=1160, Max=678911, Min=393, Avg=17138,98, 90=36191, 99=186495, 99.9=671231, 99.99=678911] 
2024-04-02 22:13:43:342 130 sec: 66932 operations; 206,49 current ops/sec; est completion in 4 minutes [INSERT: Count=2061, Max=824831, Min=305, Avg=9648,83, 90=13415, 99=157183, 99.9=633855, 99.99=824831] 
2024-04-02 22:13:53:344 140 sec: 72068 operations; 513,55 current ops/sec; est completion in 4 minutes [INSERT: Count=5136, Max=475135, Min=220, Avg=3881,26, 90=7143, 99=43615, 99.9=134655, 99.99=403199] 
2024-04-02 22:14:03:343 150 sec: 76574 operations; 450,65 current ops/sec; est completion in 4 minutes [INSERT: Count=4506, Max=233983, Min=287, Avg=4419,59, 90=9463, 99=31519, 99.9=115327, 99.99=233983] 
2024-04-02 22:14:13:343 160 sec: 80864 operations; 429 current ops/sec; est completion in 3 minutes [INSERT: Count=4290, Max=185343, Min=326, Avg=4647,32, 90=10735, 99=34943, 99.9=123135, 99.99=185343] 
2024-04-02 22:14:23:346 170 sec: 88352 operations; 748,58 current ops/sec; est completion in 3 minutes [INSERT: Count=7489, Max=174463, Min=276, Avg=2664,79, 90=5351, 99=17455, 99.9=55903, 99.99=149887] 
2024-04-02 22:14:33:352 180 sec: 91232 operations; 287,83 current ops/sec; est completion in 3 minutes [INSERT: Count=2881, Max=248703, Min=288, Avg=6917,33, 90=14439, 99=67007, 99.9=136959, 99.99=248703] 
2024-04-02 22:14:43:342 190 sec: 100051 operations; 882,69 current ops/sec; est completion in 3 minutes [INSERT: Count=8817, Max=134399, Min=129, Avg=2260,42, 90=4507, 99=13655, 99.9=52095, 99.99=130751] 
2024-04-02 22:14:53:343 200 sec: 110665 operations; 1061,4 current ops/sec; est completion in 2 minutes [INSERT: Count=10614, Max=1244159, Min=110, Avg=1878,99, 90=3109, 99=11071, 99.9=71615, 99.99=958975] 
2024-04-02 22:15:03:342 210 sec: 119782 operations; 911,7 current ops/sec; est completion in 2 minutes [INSERT: Count=9118, Max=98815, Min=116, Avg=2186,79, 90=4407, 99=13823, 99.9=33855, 99.99=98111] 
2024-04-02 22:15:13:346 220 sec: 122549 operations; 276,59 current ops/sec; est completion in 2 minutes [INSERT: Count=2766, Max=176127, Min=132, Avg=7194,65, 90=15551, 99=63231, 99.9=119935, 99.99=176127] 
2024-04-02 22:15:23:342 230 sec: 129811 operations; 726,49 current ops/sec; est completion in 2 minutes [INSERT: Count=7262, Max=182911, Min=158, Avg=2749,62, 90=5187, 99=19759, 99.9=77567, 99.99=174975] 
2024-04-02 22:15:33:345 240 sec: 137903 operations; 809,04 current ops/sec; est completion in 1 minute [INSERT: Count=8092, Max=85695, Min=123, Avg=2463,96, 90=5031, 99=14775, 99.9=39871, 99.99=61215] 
2024-04-02 22:15:43:343 250 sec: 144524 operations; 662,23 current ops/sec; est completion in 1 minute [INSERT: Count=6621, Max=123519, Min=129, Avg=3010,41, 90=5559, 99=16151, 99.9=55871, 99.99=111423] 
2024-04-02 22:15:53:343 260 sec: 151825 operations; 730,1 current ops/sec; est completion in 1 minute [INSERT: Count=7301, Max=54079, Min=126, Avg=2731,19, 90=5255, 99=15015, 99.9=37567, 99.99=52991] 
2024-04-02 22:16:03:342 270 sec: 159188 operations; 736,3 current ops/sec; est completion in 1 minute [INSERT: Count=7363, Max=67071, Min=176, Avg=2703,32, 90=5271, 99=19471, 99.9=41887, 99.99=61887] 
2024-04-02 22:16:13:342 280 sec: 167662 operations; 847,4 current ops/sec; est completion in 55 seconds [INSERT: Count=8474, Max=68415, Min=228, Avg=2351,61, 90=4423, 99=13119, 99.9=40735, 99.99=56831] 
2024-04-02 22:16:23:342 290 sec: 176083 operations; 842,1 current ops/sec; est completion in 40 seconds [INSERT: Count=8421, Max=153215, Min=240, Avg=2366,83, 90=4771, 99=19439, 99.9=64479, 99.99=136575] 
2024-04-02 22:16:33:370 300 sec: 179676 operations; 358,3 current ops/sec; est completion in 34 seconds [INSERT: Count=3593, Max=115711, Min=287, Avg=5533, 90=12207, 99=39455, 99.9=65055, 99.99=115711] 
2024-04-02 22:16:43:343 310 sec: 180602 operations; 92,87 current ops/sec; est completion in 34 seconds [INSERT: Count=926, Max=739327, Min=393, Avg=21597,41, 90=51455, 99=224767, 99.9=694783, 99.99=739327] 
2024-04-02 22:16:53:342 320 sec: 188152 operations; 755 current ops/sec; est completion in 21 seconds [INSERT: Count=7552, Max=108607, Min=114, Avg=2640,74, 90=4799, 99=13311, 99.9=42495, 99.99=94335] 
2024-04-02 22:17:03:343 330 sec: 193720 operations; 556,74 current ops/sec; est completion in 11 seconds [INSERT: Count=5566, Max=1028095, Min=184, Avg=3584,22, 90=6435, 99=17247, 99.9=36255, 99.99=1028095] 
2024-04-02 22:17:12:567 339 sec: 200000 operations; 681,57 current ops/sec; [CLEANUP: Count=2, Max=9879, Min=17, Avg=4946,5, 90=9879, 99=9879, 99.9=9879, 99.99=9879] [INSERT: Count=6280, Max=103359, Min=198, Avg=1911,46, 90=3903, 99=13095, 99.9=39231, 99.99=97279] 
[OVERALL], RunTime(ms), 339207
[OVERALL], Throughput(ops/sec), 589.6104738404573
[TOTAL_GCS_PS_Scavenge], Count, 78
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1104
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3254649815599324
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 78
[TOTAL_GC_TIME], Time(ms), 1104
[TOTAL_GC_TIME_%], Time(%), 0.3254649815599324
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 4946.5
[CLEANUP], MinLatency(us), 17
[CLEANUP], MaxLatency(us), 9879
[CLEANUP], 95thPercentileLatency(us), 9879
[CLEANUP], 99thPercentileLatency(us), 9879
[INSERT], Operations, 200000
[INSERT], AverageLatency(us), 3320.965105
[INSERT], MinLatency(us), 110
[INSERT], MaxLatency(us), 1244159
[INSERT], 95thPercentileLatency(us), 9367
[INSERT], 99thPercentileLatency(us), 30751
[INSERT], Return=OK, 200000


########################################################################################################################
##CASSANDRA DB 200K WORKLOAD A

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2024-04-02 22:40:42:121 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-02 22:40:51:809 10 sec: 511 operations; 51,09 current ops/sec; est completion in 1 hour 5 minutes [INSERT: Count=511, Max=452863, Min=2212, Avg=16693,5, 90=23327, 99=304895, 99.9=449279, 99.99=452863] 
2024-04-02 22:41:01:809 20 sec: 3125 operations; 261,43 current ops/sec; est completion in 21 minutes [INSERT: Count=2614, Max=436735, Min=1109, Avg=7645,17, 90=13135, 99=63647, 99.9=294399, 99.99=436735] 
2024-04-02 22:41:11:810 30 sec: 7482 operations; 435,7 current ops/sec; est completion in 12 minutes [INSERT: Count=4357, Max=124031, Min=784, Avg=4555,13, 90=8815, 99=46207, 99.9=102335, 99.99=124031] 
2024-04-02 22:41:21:810 40 sec: 8135 operations; 65,29 current ops/sec; est completion in 15 minutes [INSERT: Count=653, Max=1513471, Min=2450, Avg=30397,8, 90=47487, 99=258431, 99.9=1511423, 99.99=1513471] 
2024-04-02 22:41:31:838 50 sec: 9859 operations; 171,9 current ops/sec; est completion in 16 minutes [INSERT: Count=1724, Max=544767, Min=1735, Avg=10893,81, 90=17311, 99=111231, 99.9=292351, 99.99=544767] 
2024-04-02 22:41:41:808 60 sec: 17120 operations; 728,28 current ops/sec; est completion in 10 minutes [INSERT: Count=7261, Max=652799, Min=763, Avg=2906,64, 90=3633, 99=16151, 99.9=171903, 99.99=652287] 
2024-04-02 22:41:51:808 70 sec: 23594 operations; 647,4 current ops/sec; est completion in 8 minutes [INSERT: Count=6474, Max=1299455, Min=676, Avg=3080,36, 90=3821, 99=17055, 99.9=102655, 99.99=1298431] 
2024-04-02 22:42:01:809 80 sec: 32867 operations; 927,3 current ops/sec; est completion in 6 minutes [INSERT: Count=9273, Max=81855, Min=539, Avg=2147,52, 90=2713, 99=8399, 99.9=29935, 99.99=81855] 
2024-04-02 22:42:11:809 90 sec: 41453 operations; 858,6 current ops/sec; est completion in 5 minutes [INSERT: Count=8586, Max=105983, Min=610, Avg=2317,37, 90=3355, 99=12311, 99.9=38943, 99.99=83135] 
2024-04-02 22:42:21:808 100 sec: 49181 operations; 772,8 current ops/sec; est completion in 5 minutes [INSERT: Count=7728, Max=332287, Min=547, Avg=2579,07, 90=3185, 99=18639, 99.9=73407, 99.99=331519] 
2024-04-02 22:42:31:808 110 sec: 57152 operations; 797,1 current ops/sec; est completion in 4 minutes [INSERT: Count=7971, Max=126207, Min=593, Avg=2496,38, 90=4191, 99=12423, 99.9=28191, 99.99=125567] 
2024-04-02 22:42:41:834 120 sec: 63265 operations; 610,02 current ops/sec; est completion in 4 minutes [INSERT: Count=6115, Max=148223, Min=784, Avg=3266,21, 90=4527, 99=14831, 99.9=47807, 99.99=138495] 
2024-04-02 22:42:51:809 130 sec: 66129 operations; 287 current ops/sec; est completion in 4 minutes [INSERT: Count=2862, Max=163327, Min=1109, Avg=6924,43, 90=11583, 99=43007, 99.9=122623, 99.99=163327] 
2024-04-02 22:43:01:809 140 sec: 72913 operations; 678,4 current ops/sec; est completion in 4 minutes [INSERT: Count=6784, Max=177151, Min=663, Avg=2940,01, 90=4183, 99=16911, 99.9=67839, 99.99=172927] 
2024-04-02 22:43:11:811 150 sec: 76946 operations; 403,22 current ops/sec; est completion in 4 minutes [INSERT: Count=4033, Max=406527, Min=493, Avg=4934,79, 90=8615, 99=33951, 99.9=99327, 99.99=406527] 
2024-04-02 22:43:21:811 160 sec: 82856 operations; 591 current ops/sec; est completion in 3 minutes [INSERT: Count=5912, Max=1022975, Min=459, Avg=3377,53, 90=4983, 99=24527, 99.9=63391, 99.99=1019903] 
2024-04-02 22:43:31:818 170 sec: 88853 operations; 599,22 current ops/sec; est completion in 3 minutes [INSERT: Count=5995, Max=315903, Min=393, Avg=3320,67, 90=5191, 99=25791, 99.9=125503, 99.99=315647] 
2024-04-02 22:43:41:808 180 sec: 98133 operations; 928,93 current ops/sec; est completion in 3 minutes [INSERT: Count=9280, Max=50431, Min=475, Avg=2151,63, 90=2847, 99=10415, 99.9=34207, 99.99=50335] 
2024-04-02 22:43:51:808 190 sec: 111109 operations; 1297,6 current ops/sec; est completion in 2 minutes [INSERT: Count=12976, Max=59711, Min=351, Avg=1537,12, 90=1842, 99=7115, 99.9=25583, 99.99=51999] 
2024-04-02 22:44:01:808 200 sec: 121981 operations; 1087,2 current ops/sec; est completion in 2 minutes [INSERT: Count=10872, Max=435967, Min=451, Avg=1834,11, 90=2043, 99=7887, 99.9=53183, 99.99=435455] 
2024-04-02 22:44:11:808 210 sec: 130754 operations; 877,3 current ops/sec; est completion in 1 minute [INSERT: Count=8773, Max=154495, Min=666, Avg=2272,83, 90=3167, 99=14223, 99.9=53119, 99.99=154111] 
2024-04-02 22:44:21:808 220 sec: 141702 operations; 1094,8 current ops/sec; est completion in 1 minute [INSERT: Count=10948, Max=962047, Min=538, Avg=1822,76, 90=2039, 99=7335, 99.9=30271, 99.99=961535] 
2024-04-02 22:44:31:808 230 sec: 153079 operations; 1137,7 current ops/sec; est completion in 1 minute [INSERT: Count=11377, Max=44607, Min=491, Avg=1753,96, 90=2327, 99=6439, 99.9=20719, 99.99=44415] 
2024-04-02 22:44:41:808 240 sec: 165357 operations; 1227,8 current ops/sec; est completion in 51 seconds [INSERT: Count=12278, Max=85247, Min=655, Avg=1625,4, 90=2109, 99=5871, 99.9=19999, 99.99=80191] 
2024-04-02 22:44:51:808 250 sec: 169630 operations; 427,3 current ops/sec; est completion in 45 seconds [INSERT: Count=4273, Max=282367, Min=611, Avg=4673,99, 90=9343, 99=36479, 99.9=186623, 99.99=282367] 
2024-04-02 22:45:01:808 260 sec: 172239 operations; 260,9 current ops/sec; est completion in 42 seconds [INSERT: Count=2609, Max=386815, Min=534, Avg=7656,84, 90=16927, 99=77503, 99.9=177535, 99.99=386815] 
2024-04-02 22:45:11:808 270 sec: 181941 operations; 970,2 current ops/sec; est completion in 27 seconds [INSERT: Count=9702, Max=346111, Min=413, Avg=2056,62, 90=2751, 99=9815, 99.9=53887, 99.99=343551] 
2024-04-02 22:45:21:808 280 sec: 190214 operations; 827,3 current ops/sec; est completion in 15 seconds [INSERT: Count=8273, Max=350975, Min=425, Avg=2412,74, 90=3011, 99=11095, 99.9=36991, 99.99=347647] 
2024-04-02 22:45:31:808 290 sec: 200000 operations; 978,6 current ops/sec; [CLEANUP: Count=1, Max=28, Min=28, Avg=28, 90=28, 99=28, 99.9=28, 99.99=28] [INSERT: Count=9786, Max=84735, Min=548, Avg=1748,81, 90=2391, 99=5603, 99.9=24127, 99.99=39199] 
2024-04-02 22:45:33:304 291 sec: 200000 operations; 0 current ops/sec; [CLEANUP: Count=1, Max=2291711, Min=2289664, Avg=2290688, 90=2291711, 99=2291711, 99.9=2291711, 99.99=2291711] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
[OVERALL], RunTime(ms), 291526
[OVERALL], Throughput(ops/sec), 686.0451554921345
[TOTAL_GCS_PS_Scavenge], Count, 167
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 880
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.30185986841653917
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 167
[TOTAL_GC_TIME], Time(ms), 880
[TOTAL_GC_TIME_%], Time(%), 0.30185986841653917
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 1145358.0
[CLEANUP], MinLatency(us), 28
[CLEANUP], MaxLatency(us), 2291711
[CLEANUP], 95thPercentileLatency(us), 2291711
[CLEANUP], 99thPercentileLatency(us), 2291711
[INSERT], Operations, 200000
[INSERT], AverageLatency(us), 2819.14739
[INSERT], MinLatency(us), 351
[INSERT], MaxLatency(us), 1513471
[INSERT], 95thPercentileLatency(us), 6575
[INSERT], 99thPercentileLatency(us), 20575
[INSERT], Return=OK, 200000